import React from 'react';
import {ChatList} from 'features/chatList/ChatList';
import s from 'app/App.module.scss'
import {ErrorSnackbar} from 'common/components/errorSnackbar/ErrorSnackbar';
import {Login} from 'features/login/Login';
import {useAppSelector} from 'common/hook/hooks';
import {selectIsLoggedIn} from 'features/login/loginSelectors';
import {Route, Routes} from 'react-router-dom';

const App = () => {
    const  isLoggedIn = useAppSelector(selectIsLoggedIn)

    return (
        <div className={s.container}>
            <ErrorSnackbar/>
            {isLoggedIn ?
                <ChatList/>
                :
                <Login/>
            }
            <Routes>
                <Route path="/chatList" element={<ChatList/>}/>
                <Route path="/login" element={<Login/>}/>
            </Routes>
        </div>
    );
}

export default App;

//ПРА ТЭАТР
{
text: [ ‘Да Усесаюзнага агляду была выдадзена брашура пра тэатр (“Тэатр юнага’ ,
‘гледача імя Н.К. Крупскай. Мн., 1940). Нарыс пра ТЮГ змешчаны ў’,
‘ падрыхтаванай да Дэкады беларускага мастацтва ў Маскве (чэрвень 1940)’,
 ‘кнізе “Искусство Советской Белоруссии” (Мн., 1940). У раздзеле’,
 ‘“Драматические театры Белоруссии» (аўтары В. Вольскі, Я. Рамановіч, А.’,
‘ Сегедзі) расказана пра стварэнне тэатра, спектаклі (асабліва з 1937 г.).’,
‘ Падрабязна пра ТЮГ ёсць у “Гісторыі беларускага тэатра” (Мн., 1985, Т.2).’,
‘Творчай дейнасці тэатра прысвечана кніга С. Пятровіча “Дзіцячы тэатр БССР’,
‘ (1931 – 1941 гг.)” (Мн., 1983). Яна задумана была аўтарам (у 1981 г. пайшоў з’,
 ‘жыцця), як першая частка кнігі пра Беларускі рэспубліканскі тэатр юнага’,
‘ гледача. Каротка дзейнасць даваеннага ТЮГа выкладзена ў брашуры,’,
 ‘падрыхтаванай да 50-годдзя сучаснага тэатра – “Беларускі рэспубліканскі ‘,
‘тэатр юнага гледача” (Мн, 2006).’,
]
},
{
text:  [‘Вялікая Айчынная вайна спыніла дзейнасць тэатра. Як вынікае з Дакладной’,
‘ запіскі ад 22 сакавіка 1943 года в.а. начальніка Упраўлення па справах’,
‘ мастацтва пры СНК СССР Е.І.Уралавай старшыні Камітэта па справах’,
 ‘мастацтва пры СНК СССР М.Б. Храпчанку аб аднаўленні тэатральнай сеткі’,
‘ БССР, намячалася на працягу 1-й паловы 1943 года аднавіць тры тэатры:’,
‘ Дзяржаўны драматычны рускі тэатр БССР, Брэсцкі абласны рускі тэатр і ‘,
‘Дзяржаўны беларускі тэатр юнага гледача (Нац. Архіў. Ф.799 П.Воп.1 Спр.2.’,
‘ С.9 ці "Белорусы в советском тылу". Июль 1941 г. – 1944 г. Сб. документов и’,
‘ материалов. – Вып.2. 1943 г. – 1944 г. Мн., 2010.). Але гэтага не адбылося. З трох ‘,
‘тэатраў быў адноўлены толькі Рускі.’,
‘У 1949 г. пра неабходнасць аднаўлення ТЮГа нагадала пісьменніца, дзеяч’,
‘ культуры Зінаіда Бандарына, выступіўшы ў газеце “Літаратура і мастацтва” 8’,
‘ кастрычніка з артыкулам “Тэатральнае мастацтва дзецям”. Яна пісала: “У ‘,
‘перыяд Вялікай Айчыннай вайны некаторыя тэатры юных гледачоў’,
‘ вымушаны былі часова расфарміравацца. Аднак у першыя пасляваенныя’,
 ‘гады яны аднавілі сваю дзейнасць… Ва ўсіх саюзнах рэспубліках працуюць…’,
‘ Усім вядома, што і ў Мінску да вайны быў ТЮГ, які на ўсесаюзным аглядзе’,
‘ дзіцячых тэатраў заняў адно з першых месц… абслугоўваў дзясяткі тысяч’,
 ‘юных гледачоў. Узнікае пытанне, чаму да гэтага часу ён не аднаўляе сваю ‘,
‘дзейнасць?.. А шматлікія юныя гледачы пазбаўлены дзіцячага тэатра.”’,
]
},
{
text: [
‘У 1951 годзе на Бюро ЦК КП (б) Беларусі (пратакол пасяджэння № 139 ад 2’,
 ‘сак. – Нац. архіў. Ф.4П, воп.81, спр.405, л.27) была прынята пастанова: “1.’,
 ‘Пабудаваць у 1951-52 гг. ў г. Мінску дзіцячы рэспубліканскі тэатр,’,
 ‘выкарыстаўшы дзеля гэтага каробку, што належыць Мінскаму Палацу’,
 ‘піянераў.” Поўнае завяршэнне будаўніцтва – 1952-ім годзе.’,
‘Нарэшце, 22 верасня 1955 г. быў падпісаны загад Міністра культуры БССР’,
 ‘Р.Я. Кісялёва аб стварэнні Беларускага рэспубліканскага тэатра юнага’,
‘ гледача. Уладзімір Стэльмах, які быў празначаны дырэктарам тэатра (ў’,
‘ даваенным ТЮГу ён служыў акцёрам і заглітам), вельмі хацеў, каб не’,
 ‘парывалася сувязь з даваенным тэатрам, каб сучасны тэатр стаў працягам’,
 ‘яго дзейнасці. Але ж кіраўніцтва рэспублікі вырашыла інакш. Прыводзіліся’,
‘ довады на карысць новага жыцця ТЮГа: мінула ўжо столькі часу, тэатр’,
 ‘ствараецца нанова, у яго новы мастацкі кіраўнік (Любоў Мазалеўская) і новы’,
 ‘калектыў (аснову трупы склалі выпускнікі яе курса Беларускага тэатральна-‘,
‘мастацкага інстытута). Гэткай была афіцыйная версія.’,
]
},
{
text: [
‘Але была і неафіцыйная. Пра яе даведалiся ў 1990-я гады. Артур Вольскі’,
 ‘(сябра тэатра з яго адкрыцця, драматург, дырэктар, нязменны загліт)’,
 ‘расказаў, што справа ў тым, што ў час вайны частка акцёраў была ў’,
‘ акупаваным Мінску, і працавалі яны ў Гарадскім тэатры. У матэрыялах’,
 ‘партархіву захоўваецца складзены Спіс работнікаў мастацтва, якія’,
 ‘знаходзіліся і працавалі ў Мінску. У раздзеле “драма” ёсць прозвішчы’,
 ‘акцёраў ТЮГа і пазначана, што працавалі яны ў Гарадскім тэатры (Нац. Архіў.’,
 ‘Ф.4П, воп.47, спр.4, л.183). Дарэчы, ніхто з тюгаўцаў пад час вызвалення ‘,
‘Беларусі нікуды не эміграваў.’,
]
},
{
text: [
‘Безумоўна, пераемнасць даваеннага і сучаснага тэатраў юнага гледача’,
‘ відавочная (пра агульныя мастацка-педагагічныя прынцыпы дзейнасці ‘,
‘тэатраў мы ўжо не будзем і гаварыць). Гэта перадусім арыентацыя на’,
 ‘нацыянальны рэпертуар. У М. Кавязіна – спроба (праўда, няўдалая) нават на’,
‘ адкрыцці паказаць напісаную для тэатра п’есу “На штурм” Янкі Маўра. У’,
‘ 1936 г. з’явіліся “Мікола Гоман” В. Сташэўскага (п’еса і спектакль высока’,
 ‘ацэнены крытыкай) і “Ная” М. Зарэцкага. Л. Мазалеўская заахвоціла’,
‘ з’яўленне п’ес Я. Пасава, А. Гутковіча і У. Хазанскага, А. Вольскага і П. Макаля,’,
‘ І. Козела (“Папараць-кветка” – візітоўка тэатра на шмат гадоў. Дыплом 1’,
 ‘ступені Усесаюзнага фестывалю тэатраў юнага гледача ў 1958 г.). Сучасны ‘,
‘тэатр, як і даваенны пад кіраўніцтвам Е.Міровіча (пасля рэфармавання) у’,
 ‘1937 г., адкрыўся спектаклем “Як гартавалася сталь” паводле М. Астроўскага.’,
 ‘Двойчы ставіліся ўжо згаданая “Цудоўная дудка” В.Вольскага (у 1939 і 1968) і’,
‘ “Рэвізор” М. Гогаля (у 1941 г. з яго распачаў сваю працу ў тэатры новы галоўны’,
 ‘рэжысёр М. Зораў, рэпетыцыі перапыніла вайна, а сучасны ТЮГ ставіў ‘,
‘камедыю ў 1960 г.). Гэтаксама двойчы адбыліся і сустрэчы з галоўным’,
 ‘тэарэтыкам і практыкам дзіцячага тэатра Аляксандрам Бранцавым. У 1933 г.’,
 ‘М. Кавязін наладзіў паездку калектыву ў Ленінград, пазнаёміў акцёраў з А.’,
 ‘Бранцавым і яго Тэатрам юных гледачоў; на Усесаюзным фестывалі’,
 ‘сустракаліся з А. Бранцавым і сучасныя тюгаўцы, а ў 1972 г. на базе тэатра’,
‘ ладзіліся саюзныя “Бранцаўскія чытанні”. У след даваеннага ТЮГа (удзел ва’,
 ‘Усесаюзным аглядзе тэатраў для дзяцей у 1939) ступаў і новы тэатр,’,
 ‘здабываючы вядомасць і прызнанне за межамі рэспублікі на Усесаюзных’,
‘ фестывалях тэатраў для дзяцей (з 1958 г.). У сучасным ТЮГу служылі акцёры’,
 ‘даваеннага ТЮГа А. Ротар, В. Окалаў, А. Якуцік, П. Бондараў, У. Говар-‘,
‘Бандарэнка, Л. Міхайлаў, У. Стэльмах (як дырэктар), З. Зяленка (памочнік’,
‘ рэжысёра), В. Станкевіч (загадчык бутафорскага цэху) А. Сагальчык’,
 ‘(загадчык пастановачнай часткі).’,
]
},
{
text: [
‘У 1966 г. часопіс “Народная асвета” (№4) надрукаваў артыкул У. Стэльмаха’,
 ‘“Шчыры сябар школы”: “Беларускаму тэатру юнага гледача – трыццаць пяць’,
‘ год. Ён быў створаны пры Мінскім доме камсамола… а першым мастацкім’,
‘ кіраўніком быў рэжысёр М. Кавязін… У 1941 годзе вайна абарвала творчую’,
‘ дзейнасць тэатра. Аднавілася яна толькі 8 красавіка 1956 года спектаклем’,
 ‘“Як гартавалася сталь”…’,
‘…Вось і лічыце, колькі гадоў зараз нашаму Тэатру юнага гледача.’,
]
},














//КАРЫСТАЛЬНІЦКАЕ ПАГАДНЕННЕ
text: [
‘1. Агульныя палажэнні’,
‘1.1. Сапраўдны дакумент вызначае правы і абавязкі Арганізацыі ўладальніка’,
 ‘сайта, пры яго стварэнні і падтрымцы, а таксама правы і абавязкі ‘,
‘Карыстальнікаў (наведвальнікаў) сайта пры яго выкарыстанні. Дадзеныя’,
‘ правілы распаўсюджваюцца на ўсіх карыстальнікаў (наведвальнікаў) сайта.’,
 ‘Выкарыстоўваючы інфармацыю і/або сервісы сайта арганізацыі,’,
 ‘Карыстальнік (наведвальнік) пацвярджае, што ён цалкам згодны з’,
‘ ніжэйпрыведзенымі ўмовамі і абавязваецца іх выконваць.’,
‘1.2. Арганізацыя пакідае за сабою права змяняць дадзеныя ўмовы без’,
‘ папярэдняга паведамлення Карыстальніку (наведвальніку). Новыя ўмовы’,
 ‘ўступаюць у сілу з моманту іх размяшчэння (публікацыі) па адра'се: http://’,
‘www.beltuz.by/’,
‘2. Інфармацыйныя рэсурсы’,
‘2.1. Інфармацыйныя рэсурсы сайта арганізацыі ўключаюць у сябе ўсе’,
‘ матэрыялы і сервісы, размешчаныя ў даменнай прасторы (http://’,
‘www.beltuz.by/). Арганізацыя захоўвае за сабою права на змяненне складу,’,
‘ зместу і месца размяшчэння ўласных інфармацыйных рэсурсаў без’,
‘ папярэдняга паведамлення пра гэта.’,
‘2.2. Арганізацыя намагаецца даць Карыстальнікам (наведвальнікам)’,
 ‘дакладную і актуальную інфармацыю. У той самы час, усе матэрыялы,’,
 ‘апублікаваныя на старонках сайта арганізацыі, ідуць пад знакам “як ёсць” (as’,
 ‘is&raqio;) з магчымымі памылкамі, без любога кшталту гарантый, выразных ці’,
‘ ўскосных.’,
‘3. Адказнасць’,
‘3.1. Арганізацыя не нясе адказнасці за прамую ці ўскосную шкоду,’,
‘ уключаючы ўпушчаную выгаду, што ўзнікае ў выніку капіравання,’,
‘ выкарыстання або немагчымасці выкарыстання матэрыялаў ці паслуг,’,
 ‘прапанаваных сайтам арганізацыі, калі адпаведнымі пагадненнямі з’,
 ‘Карыстальнікамі (наведвальнікамі) не абумоўлена іншае.’,
‘3.2. Арганізацыя не нясе адказнасці за змест і пэўнасць рэкламных і’,
 ‘інфармацыйных матэрыялаў трэціх асоб, размешчаных на старонках сайта’,
‘ арганізацыі.’,
‘3.3. Арганізацыя не нясе адказнасці за скіраванасць і дзейнасць іншых ‘,
‘сайтаў, даступных праз старонкі сайта арганізацыі шляхам гіперспасылкі.’,
‘ Пераход на любы іншы сайт ажыццяўляецца на адказнасць Карыстальніка’,
‘ (наведвальніка).’,
‘3.4. Сапраўдны дакумент забараняе:’,
‘· выкарыстанне матэрыялаў, размешчаных на інфармацыйных рэсурсах ‘,
‘сайта арганізацыі, у камерцыйных мэтах без падпісання адпаведных’,
‘ пагадненняў з арганізацыяй;’,
‘· выкарыстанне матэрыялаў, размешчаных на іфармацыйных рэсурсах’,
‘ сайта арганізацыі, любым чынам, які можа пашкодзіць рэпутацыі арганізацыі,’,
‘ уключаючы цытаванне са скажоным сэнсам.’,
‘3.5. Узнаўленне арыгінальных матэрыялаў, без спасылкі на першакрыніцу і’,
 ‘без згадвання імені аўтара (калі матэрыял падпісаны) з’яўляецца’,
‘ парушэннем беларускага і міжнароднага заканадаўства і цягне за сабою’,
‘ ўсталяваную заканадаўствам адказнасць.’,
‘3.6. Арганізацыя забяспечвае захаванне канфідэнцыяльнасці інфармацыі’,
‘ пра карыстальнікаў сайта арганізацыі з выключэннем выпадкаў,’,
‘ прадугледжаных заканадаўствам Рэспублікі Беларусь.’,
]

//ПАРАДАК АПЛАТЫ

text: [
‘Совершить оплату можно с использованием наличных денежных средств, электронных’,
‘денег и банковских платежных карточек в пунктах банковского обслуживания банков,’,
‘которые оказывают услуги по приему платежей, а также посредством инструментов’,
‘дистанционного банковского обслуживания.’,
‘ДЛЯ ПРОВЕДЕНИЯ ПЛАТЕЖА НЕОБХОДИМО:’,
‘1. Выбрать’,
‘Пункт "Система "Расчет" (ЕРИП)’,
‘Билеты, Лотереи’,
‘beltuz.by –Тэатр юнага гледача’,
‘1.Для оплаты билетов ввести Номер заказа’,
‘2.Проверить корректность информации’,
‘3.Совершить платеж.’,
‘Если Вы осуществляете платеж в кассе банка, пожалуйста, сообщите кассиру о’,
‘необходимости проведения платежа через систему "Расчет" (ЕРИП).’,
]

//ПАСЛУГІ
{
text: [
‘Беларускі дзяржаўны акадэмічны тэатр юнага гледача прадстаўляе шэраг’,
 ‘паслуг:’,
‘Арэнда памяшканняў тэатра.’,
‘Арэнда абсталявання тэатра.’,
‘Правядзенне сумесных мерапрыемстваў.’,
‘Падрабязней па тэлефоне: намеснік дырэктара Баброва Ірына’,
 ‘Аляксандраўна +375 (17) 378-48-54’,
‘Запрашаем на экскурсію па тэатральнаму закуліссю групы ад 10 да 25 чалавек.’,
‘*Фармат правядзення экскурсій для дзяцей адрозніваецца тым, што для’,
 ‘дзіцячых групп экскурсія праходіць у гульнявой форме (інтэрактыўная’,
 ‘праграма, віктарыны).’,
],
text: [
‘<b>У праграму ўваходзіць:</b>’,
‘– кароткая гісторыя ўзнікнення ТЮГа, яго сучаснае становішча і планы на’,
 ‘будучыню;’,
‘– устройства глядзельнай залы, яе гістарычныя асаблівасці, правілы’,
 ‘паводзін;’,
‘– падрабязны агляд канструкцыі сцэны тэатра (кулісы, партал, карман сцэны,’,
 ‘паваротнае кола, трум і г.д.);’,
‘– знаёмства з цэхамі (касцюмерным, швейным, бутафорскім, мастацкім і г.д.),’,
‘ іх роля ў стварэнні новага спектакля і асаблівасці працы кожнага майстра*;’,
‘– знаёмства з тэатральным музеем.’,
‘* Наведванне цэхаў магчыма толькі ў працоўныя дні. У выхадныя цэха не’,
 ‘працуюць, але арганізацыя экскурсіі магчымая з наведваннем тэатральнага’,
 ‘музея.’,
‘Працягласць: 1 гадзіна.’,
‘Экскурсія праходзіць на рускай і беларускай мовах па папярэдняй’,
 ‘дамоўленасці.’,
‘<b>Заказаць экскурсію можна па тэлефонах: </b>’,
‘+375 (17) 379-08-72, +375 (44) 732-63-97’,
Кошт з чалавека: 8 BYN. </b>’,
],
}

//ПРАФСАЮЗ

{
text: [
‘<b>Беларускі прафесійны саюз работнікаў культуры, інфармацыі, спорту і турызму –</b>’,
 ‘добраахвотная грамадская арганізацыя, якая аб'ядноўвае грамадзян, якія працуюць у’, ‘арганізацыях любых арганізацыйна-прававых форм уласнасці сфер культуры,’,
‘мастацтва, тэлерадыёвяшчання, паліграфіі, кнігавыдання, сродкаў масавай інфармацыі,’,
 ‘друку, фізічнай культуры, спорту і турызму, творчых саюзах і фондах, органах кіравання’,
 ‘культурай, інфармацыяй (ідэалагічнай работы), спортам і турызмам, іншых арганізацыях і’, ‘грамадскіх аб'яднаннях; навуковых установах названых сфер, асоб, якія навучаюцца ва’,
 ‘ўстановах, якія забяспечваюць атрыманне прафесійна-тэхнічнай, сярэдняй спецыяльнай,’, ‘вышэйшай адукацыі (навучэнцаў, студэнтаў, магістрантаў, аспірантаў, дактарантаў),’,
‘перападрыхтоўку работнікаў з адрывам ад вытворчасці названых сфер, а таксама’,
 ‘работнікаў прадпрыемстваў, устаноў і арганізацый, створаных на аснове ўласнасці’,
 ‘Федэрацыі прафсаюзаў Беларусі, размешчаных на тэрыторыі Рэспублікі Беларусь, якія’,
 ‘прызнаюць Статут, для абароны сваіх прафесійных, працоўных, сацыяльна-эканамічных’,
 ‘правоў і законных інтарэсаў.’,
‘<b>Мэтамі</b> Беларускага прафесійнага саюза работнікаў культуры, інфармацыі, спорту і’,
 ‘турызму з'яўляюцца:’,
‘абарона працоўных, сацыяльна-эканамічных правоў і законных інтарэсаў членаў’,
‘прафсаюза;’,
‘павышэнне жыццёвага ўзроўню і матэрыяльнага дабрабыту членаў Прафсаюза’,
 ‘работнікаў культуры, інфармацыі, спорту і турызму.’,
‘Склад прафсаюзнай арганізацыі’,
‘Старшыня прафсаюзнага камітэта Плотнікава Ірына Пятроўна (спецыяліст па сувязях з’, ‘грамадскасцю, тэл.: +375 (17) 242-77-30)’,
‘Казначэй Лайкевіч Вольга Пятроўна (вядучы бухгалтар, тэл.: +375 (17) 379-11-59)’,
‘Паштовы адрас: 220030, Рэспубліка Беларусь, г. Мінск, вул. Энгельса, 26’,
‘Тэлефон/ факс (017) 242-77-32’,
‘Электронны адрас: ploir@mail.ru’,
‘<b>Банкаўскія рэквізіты: </b>  р/р BY68 AKBB 3015 5240 0233 1000 0000 у ААТ « АСБ’,
 ‘БЕЛАРУСБАНК», г. Мінск, вул. Воронянского, 7а БIК АКBBBY2X, УНП 101176797’,
]
}


//ВЯРНУТЬ БИЛЕТЫ
[
{
Id: 1,
text: [
‘Уваходныя білеты могуць быць вернутыя:’,
]
},
{
Id: 2,
text: [
‘1. Па ініцыятыве грамадзяніна, юрыдычнай асобы не пазней чым за адзін каляндарны дзень* да дня правядзення культурна- відовішчнага’,
‘мерапрыемства. Пры гэтым грамадзяніну або юрыдычнай асобе, якія вярнулі ўваходны білет, кампенсуецца 100 працэнтаў кошту’,
 ‘ўваходнагабілета.’,
‘*Калі днём правядзення мерапрыемства з'яўляецца 10-е чысло месяца, то апошнім днём вяртання білета будзе 8-е чысло месяца.’,
‘Згодна часткі 2 пункта 1 артыкула 195 Грамадзянскага Кодэкса Рэспублікі Беларусь «Парадак ажыццяўлення дзеянняў у апошні дзень тэрміну» калі’,
‘ тэрмін устаноўлены для ажыццяўлення якога-небудзь дзеяння, і гэта дзеянне павінна быць здзейснена ў арганізацыі, то тэрмін сыходзіць у тую’,
 ‘гадзіну, калі ў гэтай арганізацыі паводле ўстаноўленых правілах спыняюцца адпаведныя аперацыі.’,
]
},
{
Id: 3,
text: [
‘У выпадку змянення складу ўдзельнікаў культурна-вiдовiшчнага мерапрыемства, адмены, змянення аб’яўленых часу (тэрмінаў) і (або) месца’,
‘ правядзення культурна- відовішчнага мерапрыемства, замены ягоіншым:’,
‘грамадзянін мае права наведаць гэта культурна-відовішчнае мерапрыемства на падставе наяўнага ўваходнага білета (за выключэннем выпадку’,
 ‘адмены культурна- відовішчнага мерапрыемства);’,
‘грамадзянін, юрыдычная асоба маюць права вярнуць уваходны білет і атрымаць грашовую кампенсацыю кошту ўваходнага білета.‘,
]
},
{
Id: 4,
text: [
‘Звяртаем увагу, што пры вяртанні грашовых сродкаў сэрвісны збор і паслуга па браніраванню білетаў не вяртаюцца, паколькі лічуцца‘,
‘здейсненымі.’,
]
},
{
Id: 5,
text: [
‘У выпадках вяртання ўваходных білетаў на культурна-відовішчнае мерапрыемства, грашовая кампенсацыя кошту ўваходнага білета выплачваецца’,
‘грамадзяніну, юрыдычнай асобе не пазней за сем каляндарных дзён з дня падачы заявы аб выплаце грашовайкампенсацыі.’,
]
},
{
Id: 6,
text: [
‘Вяртанне грашовых сродкаў пакупніку за білеты, якія ён набыў у білетных аператараў, ажыццяўляецца з аўторка па пятніцу з 11.00 да 15.00 гадзін у’,
‘касе тэатра пры наяўнасці ў пакупніка білетаў на афіцыйных бланках ці раздрукаваных электронных білетаў.’,
‘Грашовыя сродкі за білеты, аплачаныя і раздрукаваныя праз сайт beltuz.by, вяртаюцца наяўнымі грошамі ў касе тэатра альбо на карт-рахунак’,
‘трымальніка карты* на працягу 7 каляндарных дзён са дня падачы заявы на вяртанне білетаў, пры наяўнасці раздрукаваных бланкаў білетаў’,
‘(абавязкова) і электроннага чэка аплаты (пажадана).’,
‘*Пры вяртанні (залічэнні) грошавых сродкаў на карт-рахунак трымальніка карты збіраецца працэнт камісіі, устаноўленай банкам эмітэнтам, які’,
‘выпусціў карту.’,
]
},
{
Id: 7,
text: [
‘Вяртанне грашовых сродкаў пакупніку за білеты, набытыя па безнаяўнаму разліку, НЕ АЖЫЦЦЯЎЛЯЕЦЦА ў касе тэатра.’
]
},
{
Id: 8,
text: [
‘Сэрвісны збор і паслуга рэзервавання не падлягаюць вяртанню!!!’
]
},
{
Id: 9,
text: [
‘Заява можа быть накiравана:’,
‘на паштовы адрас тэатра: г. Мiнск, вул. Энгельса, 26; 220030.’,
‘на электронны адрас: tuz.priemnaya@gmail.com]’,
},
]

//НАБЫТЬ БИЛЕТЫ

[
{
Id:1,
title: I. У КАСЕ ТЭАТРА па адрасе: г. Мінск, вул. Энгельса, 26.,
lightGreyText: Рэжым працы білетнай касы:,
text: [
‘<b>У зімовы перыяд з 1 верасня па 31 мая</b>’,
‘аўторак-субота 10.00-19.00;’,
‘нядзеля 10.00-17.00;’,
‘панядзелак – выхадны дзень;’,
]
},
{
Id:1,
lightGreyText: Каса не працуе ў дзяржаўныя святочные дні.,
text: [
‘<b>Браніраванне і набыццё білетаў без камісіі па тэлефоне: </b>’,
‘+375 (17) 242-77-31’
]
},
{
Id:1,
text: [
 ‘<b>Калектыўныя заяўкі на білеты прымаюцца па тэл/факс.: </b>’,
‘+375 (17) 242-77-31, +375 (17) 357-29-25’
]
},
]




    export const vacancy = {
buttonOpen: ‘ПАДРАБЯЗНЕЙ’,
buttonCloset: ‘ЗГАРНУТЬ’,
contacts: ‘Кантактны тэлефон’,
salary: ‘Зарплата:’
responsibilities: ‘Патрабаванні’,
addInfo: ‘Дадатковая інфармацыя’,
}

export type VacanciesType = {
nameVacancy: string
salary: string
contacts: string
responsibilitiesText: string[]
addInfoText: string[]
}



type PropsType = {
oneVacansy: VacanciesType
}

export const Vacancy = ({oneVacansy }: PropsType): JSX.Element=> {
const [isOpen, setIsOpen] = useState(false)

const openDetais = () => {
setIsOpen(!isOpen)
}

return (
<div>

<div>
<h2>
{ oneVacansy. nameVacancy }
</h2>
<p>
{ vacancy.salary }: { oneVacansy.salary }:
</p>
</div>
{isOpen && <div>
<div>
<h3 >
{ vacancy.contacts }
</ h3>
<p>
Phone or text
</p>
</div>


</div>}
<button onClick={openDetais}>{ isOpen ?  vacancy.buttonOpen :  vacancy.buttonCloset } </button>
</div>

)

}







<div></div>







    
